examples/tobias_tutorial/arbitrary_water_pump/templates/system/foamDictionaryDict
{
    -entry baffle_master -set fanPressureJump
}
